notkevingong/onsetbot/build/onset_interfaces/rosidl_typesupport_introspection_c/onset_interfaces/msg/detail/stm32_message__type_support.c
// generated from rosidl_typesupport_introspection_c/resource/idl__type_support.c.em
// with input from onset_interfaces:msg/STM32Message.idl
// generated code does not contain a copyright notice

#include <stddef.h>
#include "onset_interfaces/msg/detail/stm32_message__rosidl_typesupport_introspection_c.h"
#include "onset_interfaces/msg/rosidl_typesupport_introspection_c__visibility_control.h"
#include "rosidl_typesupport_introspection_c/field_types.h"
#include "rosidl_typesupport_introspection_c/identifier.h"
#include "rosidl_typesupport_introspection_c/message_introspection.h"
#include "onset_interfaces/msg/detail/stm32_message__functions.h"
#include "onset_interfaces/msg/detail/stm32_message__struct.h"


#ifdef __cplusplus
extern "C"
{
#endif

void onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_init_function(
  void * message_memory, enum rosidl_runtime_c__message_initialization _init)
{
  // TODO(karsten1987): initializers are not yet implemented for typesupport c
  // see https://github.com/ros2/ros2/issues/397
  (void) _init;
  onset_interfaces__msg__STM32Message__init(message_memory);
}

void onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_fini_function(void * message_memory)
{
  onset_interfaces__msg__STM32Message__fini(message_memory);
}

static rosidl_typesupport_introspection_c__MessageMember onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_member_array[6] = {
  {
    "angle_launch",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_DOUBLE,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, angle_launch),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  },
  {
    "power_on_status",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_UINT8,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, power_on_status),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  },
  {
    "home_elbow_request",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_UINT8,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, home_elbow_request),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  },
  {
    "stm32_state_request",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_UINT8,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, stm32_state_request),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  },
  {
    "onset_state",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_UINT8,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, onset_state),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  },
  {
    "loader_request",  // name
    rosidl_typesupport_introspection_c__ROS_TYPE_UINT8,  // type
    0,  // upper bound of string
    NULL,  // members of sub message
    false,  // is array
    0,  // array size
    false,  // is upper bound
    offsetof(onset_interfaces__msg__STM32Message, loader_request),  // bytes offset in struct
    NULL,  // default value
    NULL,  // size() function pointer
    NULL,  // get_const(index) function pointer
    NULL,  // get(index) function pointer
    NULL,  // fetch(index, &value) function pointer
    NULL,  // assign(index, value) function pointer
    NULL  // resize(index) function pointer
  }
};

static const rosidl_typesupport_introspection_c__MessageMembers onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_members = {
  "onset_interfaces__msg",  // message namespace
  "STM32Message",  // message name
  6,  // number of fields
  sizeof(onset_interfaces__msg__STM32Message),
  onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_member_array,  // message members
  onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_init_function,  // function to initialize message memory (memory has to be allocated)
  onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_fini_function  // function to terminate message instance (will not free memory)
};

// this is not const since it must be initialized on first access
// since C does not allow non-integral compile-time constants
static rosidl_message_type_support_t onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_type_support_handle = {
  0,
  &onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_members,
  get_message_typesupport_handle_function,
};

ROSIDL_TYPESUPPORT_INTROSPECTION_C_EXPORT_onset_interfaces
const rosidl_message_type_support_t *
ROSIDL_TYPESUPPORT_INTERFACE__MESSAGE_SYMBOL_NAME(rosidl_typesupport_introspection_c, onset_interfaces, msg, STM32Message)() {
  if (!onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_type_support_handle.typesupport_identifier) {
    onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_type_support_handle.typesupport_identifier =
      rosidl_typesupport_introspection_c__identifier;
  }
  return &onset_interfaces__msg__STM32Message__rosidl_typesupport_introspection_c__STM32Message_message_type_support_handle;
}
#ifdef __cplusplus
}
#endif
